public class ReferencesTexts
{
    final static String VERSION = "Версия: 1.0.11";
    final static String GENERAL_HOTKEYS =
                    "   Alt+M - Помощь\n" +
                    "   Alt+A - О программе\n" +
                    "   F1 - Справка\n" +
                    "   Esc - отмена/закрыть окно\n" +
                    "   TAB - переход на следующий объект\n" +
                    "   Shift+TAB - переход на предыдущий объект";
    final static String MAINFORM_HOTKEYS =
            "   Ctrl+F - поиск записей\n" +
            "   Ctrl+D - следующий фильтр поиска\n" +
            "   Ctrl+G - предыдущий фильтр поиска\n" +
            "   Ctrl+W - создать запись\n" +
            "   Ctrl+E - редактировать запись\n" +
            "   Ctrl+R - удалить запись\n" +
            "   Ctrl+P - печать поздравления";
    final static String PERSONFORM_HOTKEYS =
            "   Ctrl+S - сохранить изменения/внести запись";
    final static String PRINTFORM_HOTKEYS =
            "   Ctrl+N - следующая страница\n" +
            "   Ctrl+B - предыдущая страница";
    final static String SYSTEM_REQUIREMENTS = "Системные требования:\n" +
            "Windows\n" +
            "Windows 10 (8u51 или более поздняя)\n" +
            "Windows 8.x (настольная версия)\n" +
            "Windows 7 с пакетом обновления 1 (SP1)\n" +
            "Windows Vista SP2\n" +
            "Windows Server 2008 R2 с пакетом обновления 1 (SP1) (64-разрядная версия)\n" +
            "Windows Server 2012 и 2012 R2 (64-разрядная версия)\n" +
            "\n" +
            "RAM: 128 МБ\n" +
            "Пространство на диске: 525 МБ для JRE; 25 МБ для файлов программы\n" +
            "Процессор: минимальное требование - Pentium 2 266 МГц\n" +
            "\n" +
            "Mac OS X\n" +
            "Mac на базе процессора Intel под управлением Mac OS X 10.8.3+, 10.9+\n" +
            "\n" +
            "Linux\n" +
            "Oracle Linux 5.5+1\n" +
            "Oracle Linux 6.x (32-разрядная версия), 6.x (64-разрядная версия)2\n" +
            "Oracle Linux 7.x (64-разрядная версия)2 (8u20 или более поздняя)\n" +
            "Red Hat Enterprise Linux 5.5+1 6.x (32-разрядная версия), 6.x (64-разрядная версия)2\n" +
            "Red Hat Enterprise Linux 7.x (64-разрядная версия)2 (8u20 или более поздняя)\n" +
            "Suse Linux Enterprise Server 10 SP2+, 11.x\n" +
            "Suse Linux Enterprise Server 12.x (64-разрядная версия)2 (8u31 или более поздняя)\n" +
            "Ubuntu Linux 12.04 LTS, 13.x\n" +
            "Ubuntu Linux 14.x (8u25 или более поздняя)\n" +
            "Ubuntu Linux 15.04 (8u45 или более поздняя)\n" +
            "Ubuntu Linux 15.10 (8u65 или более поздняя)";
    final static String FUNCIONS = "Информационно-поисковая система \"Записная книжка\" предназначена для записи, просмотра и хранения анкетных данных, а так же для печати именной открытки поздравления с Днем рождения. Для удобства использования данной системы предусмотрена функция поиска с несколькими фильтрами, а так же несколько видов сортировки записей.";
    final static String MAIN_FORM = "Главное окно состоит из двух частей - слева расположена таблица с внесенными записями, над таблицей в раскрывающейся панели расположено текстовое поле ввода для поиска записей, а так же три вида фильтра. Справа от таблицы находятся подписанные панели подробной информации о выделенной записи. Внизу находятся кнопки для добавления, редактирования, удаления записи, а так же кнопка для создания открыти поздравления с Днем рождения с последующим выводом этой открытки на печать. При запуске программы кнопки \"Редактировать запись\", \"Удалить запись\" и \"Поздравление на печать\" неактивны. Для того что бы редактировать запись, удалить запись или создать открытку поздравления необходимо сначала выделить запись в таблице и тогда соответствующие кнопки станут активными. Те же функции можно выполнить с помощью контекстного меню, нажав правой кнопкой мыши по записи в таблице, или с помощью сочетаний клавиш (см. раздел \"Горячие клавиши\").";
    final static String ADDEDIT_FORM = "Окно редактирования/добавления записи представляет собой окно с текстовыми полями для заполения и одним выпадающим списком. Поля \"Фамилия\", \"Телефон\" и \"Адрес\" являются обязательными для заполнения, поэтому они подсвечены красной рамкой. Если эти поля не пусты, рамка становится зеленой. Снизу окна находятся кнопки \"Внести запись\" или \"Сохранить изменения\" в зависимости от выполняемого действия, а так же кнока \"Отмена\" для отмены действия и закрытия окна.";
    final static String PRINTCONGR_FORM = "Окно вывода поздравления на печать состоит из заголовка в верхней части окна, кнопок \"Вперед\", \"Назад\", \"Отмена\" и номера страницы в нижней части окна. Центральная часть окна зависит от страницы - на странице 1 находятся макеты открыток, при выборе открытки она подсветится синей рамкой; на странице 2 находятся три текстовых поля (Заголовок поздравления, Текст поздравления и Подпись поздравления) и меню с выпадающим списком, текстовые поля уже заполнены заготовленными текстами, но их можно изменить; на странице 3 находится получившийся макет поздравления для печати, а так же в нижней части кнопку \"Вперед\" заменяет кнопка \"Распечатать\".";
    final static String BROWSE_PERSON = "Для просмотра полной информации о записи достаточно нажать на запись левой кнопкой мыши (или перейти на таблицу с помощью TAB и нажать ENTER) и справа в соответствующих полях отобразится подробная информация.";
    final static String FIND_PERSONS = "Для осуществления поиска записи необходимо нажать на раскрывающуюся панель \"Поиск записей\" и затем в текстовом поле начать водить текст. Так же для осуществления поиска можно нажать сочетание клавиш Ctrl+F. Результат поиска сразу же отображается в таблице при наборе текста. \n" +
            "Поиск в программе осуществляется по трем фильтрам - \"по фамилии\", \"по месту работы или учёбы\" и \"по характеру знакомства\". Если в записи отсутствует информация о месте работы/учёбы или о характере знакомства, то эта запись найдена не будет.";
    final static String SORT_PERSONS = "Для осуществления сортировки записей достаточно нажать на заголовок колонки в таблице. Например, для сортировки записей по Ф.И.О. надо нажать на заголовок колонки \"Ф.И.О.\" левой кнопкой мыши, тогда записи в таблице изменят порядок, а справа от заголовка появится черный треугольник, у которого основание направленно вниз, это означает что записи в таблице отсортированы по алфавиту, если нажать на заголовок еще раз, то черный треугольник будет с основанием, направленным вверх - это означает что записи в таблице отсортированы по алфавиту, но в обратном порядке. При третьем нажатии - треугольник исчезнет, а записи в таблице примут порядок по умолчанию.\n" +
            "Сортировка по колонке \"Телефон\" происходит по схожему принципу, только записи сортируются от наименьшего к большему и наборот. Сортировка по колонке \"Адрес\" происходит так же по алфавиту.\n";
    final static String ADD_PERSON = "Добавить запись можно тремя способами:\n" +
            "1. Нажать кнопку \"Добавить запись\", расположенную в левом нижнем углу окна.\n" +
            "2. Вызвать контекстное меню, нажав правой кнопкой мыши по таблице и выбрать \"Добавить запись\".\n" +
            "3. Нажать сочетание клавиш Ctrl+W.\n" +
            "В открывшемся окне необходимо обязательно заполнить поля \"Фамилия\", \"Телефон\" и \"Адрес\", иначе запись невозможно будет добавить. Обязательные для заполнения поля ввода подсвечиваются красной рамкой. Если обязательное для заполнения поле станет не пустым, то оно будет подсвечено зеленой рамкой. \n" +
            "Для заполнения поля ввода \"Должность\" необходимо либо выбрать должность из выпадающего списка, нажав кнопку с маленьким черным треугольником слева от поля ввода, либо начать вводить должность и затем выбрать необходимую должность из автоматически выпадающего списка. При отсутствии необходимой должности ее можно добавить, нажав на кнопку справа от поля ввода с изображением зеленого знака \"+\", затем в появившемся небольшом окне ввести название новой должности и нажать кнопку \"Ок\". Также, можно редактировать названия должностей из списка - для этого необходимо выбрать должность из списка, затем нажать кнопку справа от поля ввода с изображением карандаша, в появившемся небольшом окне внести необходимые изменения в названии должности и затем нажать кнопку \"Ок\". Для удаления должности надо выбрать должность из списка и справа от поля ввода нажать кнопку с изображением мусорного бака.\n" +
            "Для добавления записи достаточно нажать кнопку \"Внести запись\". При успешном добавлении записи на экран выведется сообщение об этом.\n" +
            "Для перехода на следующее поле ввода нажмите TAB. Что бы перейти на предыдущее поле ввода надо нажать сочетание клавиш Shift+TAB. После поля ввода \"Деловые качества\" при нажатии TAB фокус перейдет на кнопку \"Внести запись\".\n" +
            "Для выхода и закрытия окна добавления записи можно нажать на крестик в правом верхнем углу либо нажать клавишу Esc.\n";
    final static String EDIT_PERSON = "Редактировать запись можно тремя способами:\n" +
            "1. Выделить необходимую запись в таблице, затем нажать на кнопку \"Редактировать запись\", расположенную в левом нижнем углу окна.\n" +
            "2. Вызвать контекстное меню, нажав правой кнопкой мыши по необходимой записи в таблице и выбрать \"Редактировать запись\"\n" +
            "3. Выделить необходимую запись в таблице и нажать сочетание клавиш Ctrl+E.\n" +
            "В открывшемся окне все соответствующие записи поля ввода будут заполнены и можно провести необходимые изменения, как при добавлении записи, при этом все также поля \"Фамилия\", \"Телефон\" и \"Адрес\" обязательно не должны быть пустыми. \n" +
            "Для сохранения изменений необходимо нажать кнопку \"Сохранить изменения\", расположенную в левом нижнем углу окна. При успешном удалении записи на экран выведется сообщение об этом.\n" +
            "Для выхода и закрытия окна редактирования записи можно нажать на крестик в правом верхнем углу либо нажать клавишу Esc.\n";
    final static String REMOVE_PERSON = "Удалить запись можно тремя способами:\n" +
            "1. Выделить необходимую запись в таблице, затем нажать на кнопку \"Удалить запись\", расположенную в левом нижнем углу окна.\n" +
            "2. Вызвать контекстное меню, нажав правой кнопкой мыши по необходимой записи в таблице и выбрать \"Удалить запись\"\n" +
            "3. Выделить необходимую запись в таблице и нажать сочетание клавиш Ctrl+R.\n" +
            "При удалении записи необходимо подтвердить удаление. При успешном удалении записи на экран выведется сообщение об этом.\n";
    final static String PRINT_CONGRATULATION = "Открыть окно для создания поздравления можно тремя способами:\n" +
            "1. Выделить необходимую запись в таблице, затем нажать на кнопку \"Поздравление на печать\", расположенную в правом нижнем углу окна.\n" +
            "2. Вызвать контекстное меню, нажав правой кнопкой мыши по необходимой записи в таблице и выбрать \"Поздравление на печать\"\n" +
            "3. Выделить необходимую запись в таблице и нажать сочетание клавиш Ctrl+P.\n" +
            "Что бы создать и распечатать открытку с поздравлением с Днем рождения необходимо выполнить действия в три шага:\n" +
            "Шаг 1:\n" +
            "На странице 1 расположено 6 шаблонов для открыток, необходимо выбрать один шаблон, нажав по нему левой кнопкой мыши. Выбранный шаблон подсветиться синей рамкой. После этого надо нажать кнопку \"Вперед\" для перехода к следующему шагу.\n" +
            "Шаг 2:\n" +
            "На странице 2 расположены три текстовых поля ввода (\"Заголовок поздравления\", \"Текст поздравления\" и \"Подпись поздравления\") и меню с выпадающим список (обращение). В полях ввода уже введен шаблонный текст, его можно изменить или оставить как есть. В выпадающем списке можно выбрать форму обращения либо ввести самому в поле ввода, находящееся слева от выпадающего списка. Для перехода к следующему, заключительному шагу надо нажать кнопку \"Вперед\".\n" +
            "Шаг 3:\n" +
            "На странице 3 расположен получившийся итоговый макет открытки с введенными на втором шаге текстами. Если итоговый макет устраивает, то для печати необходимо нажать кнопку \"Распечатать\", которая находится вместо кнопки \"Вперед\".\n" +
            "После печати открытки окно автоматически закроется. Так же окно можно закрыть в любой момент, нажав на кнопку \"Отмена\" или клавишу Esc.\n" +
            "Переход между страницами осуществляется с помощью кнопок \"Вперед\" и \"Назад\" или с помощью сочетания клавиш Ctrl+N и Ctrl+B соответственно.\n" +
            "При возвращении на страницу 1 необходимо заново выбрать шаблон макета открытки, тексты на странице 2 при этом сохранятся, пока страница не закрыта.\n";
    final static String INFO_ABOUT = "Программа придумана, разработана и написана по заданию производственной практики студентом 3 курса Гулий А.В.\n" +
            "группа: 3ИСП-1\n" +
            "специальность: Информационные системы и программирование, ГБОУ «Магаданский политехнический техникум» \n" +
            "предмет: Осуществление интеграции программных модулей";
    final static String INSTRUMENTS = "При разработке настоящего программного продукты были использованы следующие средства:\n" +
            "Языки программирования: Java (SDK 10.0.2), Delphi 10.3\n" +
            "База данных: SQLite (version 3.2.1)\n" +
            "Менеджер баз данных: SQLiteStudio\n" +
            "Интегрированные среды разработки (IDE): IntelliJ IDEA 2020.2.2 (Commutity Edition), RAD Studio Embarcadero® Delphi 10.3";
    final static String CONTACTS = "По всем вопросам и предложениям писать на электронную почту elizgerd@yandex.ru";
}
